validation/full/isoConstBurnRefine/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-0.002  0.00  -0.0005)
    ( 0.002  0.00  -0.0005)
    ( 0.002  0.02  -0.0005)
    (-0.002  0.02  -0.0005)
    (-0.002  0.00   0.0005)
    ( 0.002  0.00   0.0005)
    ( 0.002  0.02   0.0005)
    (-0.002  0.02   0.0005)

    // (-0.002  0.02  -0.0005) 8 - 3
    // ( 0.002  0.02  -0.0005) 9 - 2
    ( 0.002  0.04  -0.0005) // 10 - 8
    (-0.002  0.04  -0.0005)
    // (-0.002  0.02   0.0005) 12 - 7
    // ( 0.002  0.02   0.0005) 13 - 6
    ( 0.002  0.04   0.0005)
    (-0.002  0.04   0.0005)
);

blocks
(
    hex (0 1 2 3 4 5 6  7) (4 20 1) edgeGrading (1 1 1 1 2 0.5 0.5 2 1 1 1 1)
    hex (3 2 8 9 7 6 10 11) (4 20 1) simpleGrading (1 1 1)
);

edges
(
    
);

boundary
(
    bottom
    {
        type patch;
        faces
        (
            (0 1 5 4)
        );
    }
    sides
    {
        type symmetryPlane;
        faces
        (
            (1 2 6 5)
            (3 0 4 7)
            (2 8 10 6)
            (9 3 7 11)
        );
    }
    frontAndBack
    {
        type symmetryPlane;
        faces
        (
            (4 5 6 7)
            (0 3 2 1)
            (7 6 10 11)
            (3 9 8 2)
        );
    }
    top
    {
        type patch;
        faces
        (
            //(3 2 6 7)
            (9 8 10 11)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
